import * as React from 'react';

export default () => (
  <div id="faq-container">
    <h1>Често поставувани прашања</h1>
    <h3>Што е Jargon?</h3>
    <p>
      Технологијата базирана на препознавање глас, може да го револуционализира
      начинот на кој ние комуницираме со машините, но во моментов сите постојни
      системи се скапи и комерцијални. Jargon е проект кој има за цел овие
      технологии да ги направи достапни за сите. Луѓето го донираат сопствениот
      глас во масивна база на податоци, што ќе им овозможи на сите да дадат
      придонес во апликации поврзани со гласовни команди, а сите гласовни
      податоци ќе им бидат достапни на сите програмери.
    </p>

    <h3>Зошто е важно?</h3>
    <p>
      Гласот е најлесниот и најприродниот начин на комуникација. Ние сакаме
      програмерите да можат да креираат софтвер од вистински преведувачи и
      административни асистенти базирани на глас. Но, во моментов нема доволен
      број јавно достапни податоци со кои може да се креираат вакви апликации.
      Jargon ќе им го даде она што им е потребно на програмерите за да можат да
      иновираат.
    </p>

    <h3>Кое е нивото на потребен квалитет за едно аудио да биде корисно?</h3>
    <p>
      Ние сакаме квалитетот на аудиото да одговара на квалитетот на она што ќе
      го има во природни услови. Сакаме варијабилност. Тоа не учи како да се
      справуваме со различни ситуации - позадински шум, бучава од возила, гласно
      навивање - и сето тоа без грешки.
    </p>

    <h3>Зошто цел за снименото аудио се 10,000 часови?</h3>
    <p>
      Тоа е приближниот број на часови потребни да се обучи еден STT систем.
    </p>

    <h3>Кој е изворот на текстот?</h3>
    <p>
      Во моментов речениците произлегуваат од донатори кои сакаат да придонесат,
      како и од јавни домени од филмски сценарија како "Титаник".
    </p>
    <p>
      Речениците може да ги прегледате во оваа датотека на{' '}
      <a
        target="_blank"
        href="https://github.com/kjanko/deep-speech-mk-sentences">
        GitHub
      </a>.
    </p>
  </div>
);
