/*
 * Error strings.
 */
export default class ERROR_MSG {
  static ERR_NO_RECORDING: string = "Ве молиме, прво снимете..";
  static ERR_NO_PLAYBACK: string = "Ве молиме прво преслушајте па прикачете.";
  static ERR_PLATFORM: string = "Вашиот пребаруваш не поддржува аудио снимки.";
  static ERR_NO_CONSENT: string = "Вие не се согласивте да снимате. Морате да кликнете на копчето \"Се согласувам\" за да ја користите оваа страница.";
  static ERR_NO_MIC: string = "Вие не дозволивте оваа страница да го користи микрофонот. На страницата и е потребен микрофонот за да го сними вашиот глас.";
  static ERR_UPLOAD_FAILED: string = "Прикачувањето на вашите снимки на сервер е неуспешно. Ова може да е привремен проблем. Ве молиме обидете се повторно.";
  static ERR_DATA_FAILED: string = "Прикачувањето на вашите профилни податоци е неусшено. Ова може да е привремен проблем. Ве молиме обидете се повторно.";
}